docs/no_bifurcation/test_foam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    WALL
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

	//valueExpression "(1.43*pow(d,2.55)/AREA)*profile";
    // Qm flow rate(m^3/s); CC:cardiac cycle; PC: pi/CC;

	INLET
	{
		type     surfaceNormalFixedValue;
		refValue -0.0049581012;
	}

    OUTLET
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //